docs/projects/star-sliders.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-09 Fri 17:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Samuel Evans-Powell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Samuel Evans-Powell" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Samuel Evans-Powell</h1>
<p>
<a id="org0eeaa9d"></a><a href="../index.html">&lt; Home</a>
</p>

<div id="outline-container-org3cbb93c" class="outline-2">
<h2 id="org3cbb93c">Star Sliders</h2>
<div class="outline-text-2" id="text-org3cbb93c">
<p>
<i>Game in a legacy codebase</i>
</p>

<p>
 <style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style><div class='embed-container'><iframe src='https://www.youtube.com/embed/qs9F-rmZ_gQ' frameborder='0' allowfullscreen></iframe></div> 
</p>

<p>
Our task was to implement a game in a previous student's codebase. This 
student's codebase was chosen by our teachers because it is particularly
esoteric and difficult to work with.
</p>

<p>
We created a little game similar to the 'surf' gamemode found in 
Counter-Strike: Source (<a href="https://www.youtube.com/watch?v=gKAOkVA2yHQ">example</a>).
</p>
</div>

<div id="outline-container-orge05d492" class="outline-3">
<h3 id="orge05d492">Things learnt:</h3>
<div class="outline-text-3" id="text-orge05d492">
<p>
How to&#x2026;
</p>
<ul class="org-ul">
<li>work with legacy codebases.</li>
<li>achieve cross-platform development with CMake build system and cross-platform libraries (SDL2, OpenGL, GLEW).</li>
<li>implement and use an octree to accelerate collision detection.</li>
<li>develop a modern OpenGL rendering engine with camera system, mesh rendering, skybox, UI.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf9d4152" class="outline-3">
<h3 id="orgf9d4152">External links</h3>
<div class="outline-text-3" id="text-orgf9d4152">
<ul class="org-ul">
<li><a href="https://bitbucket.org/samdelion/seaview">Bitbucket</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Samuel Evans-Powell</p>
<p class="date">Created: 2018-02-09 Fri 17:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
